src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Сотрудник является клиентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIВес</Name>
					<Comment>Вес сотрудника для API, сначала выводятся более тяжелые</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Comment>Код по ОМС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляСайтаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпецилазацииСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Comment>Основная специализация</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницыЖурналаЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НастройкиСотрудников/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция - Вернуть сегмент номенклатуры по сотруднику
//
// Параметры:
//  Сотрудник			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьСегментНоменклатурыПоСотруднику(Сотрудник, СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкиСотрудников.СегментыНоменклатуры КАК СегментНоменклатуры
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник = &Сотрудник
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("Сотрудник"		  , Сотрудник);	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.СегментНоменклатуры, Справочники.СегментыНоменклатуры.ПустаяСсылка());
	
КонецФункции

// Функция - Получить вид цен сотрудника
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВидЦенСотрудника(СтруктурнаяЕдиница, Сотрудник) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.ВидЦен
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник = &Сотрудник
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("Сотрудник"		  , Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ВидЦен, Неопределено);
		
КонецФункции

// Функция - Получить дату приема сотрудника
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДатуПриемаСотрудника(Сотрудник, СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.ДатаПриема
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник = &Сотрудник
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("Сотрудник"		  , Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ДатаПриема, Неопределено);
		
КонецФункции 

// Функция - Получить дату приема сотрудника
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДатуУвольненияСотрудника(Сотрудник, СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.ДатаУвольнения
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник = &Сотрудник
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("Сотрудник"		  , Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ДатаУвольнения, Неопределено);
		
КонецФункции

// Функция - Получить места работы сотрудника
//
// Параметры:
//  Сотрудник					 - 	 - 
//  ТипВозвращаемыхДанных		 - Строка - Если не указан - вернет массив
//  ВыбраннаяСтруктурнаяЕдиница	 - 	 - 
//  ДобавлятьТекущую			 - Булево - Добавляет, в случае отсутствия, текущую клинику
// 
// Возвращаемое значение:
//   - Список/Массив
//
Функция ПолучитьМестаРаботыСотрудника(Сотрудник = Неопределено
									, ТипВозвращаемыхДанных = "Список"
									, ВыбраннаяСтруктурнаяЕдиница = Неопределено
									, ДобавлятьТекущую = Ложь
									, ИспользоватьЗакешированноеЗначение = Истина) Экспорт
	
	Возврат Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(Сотрудник, ТипВозвращаемыхДанных,ВыбраннаяСтруктурнаяЕдиница,ДобавлятьТекущую,ИспользоватьЗакешированноеЗначение);	
	
КонецФункции	

// Функция - Получить сотрудников клиники
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  МассивСотрудников	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковКлиники(СтруктурнаяЕдиница, МассивСотрудников = Неопределено) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Сотрудник В(&МассивСотрудников)
	|	И ВЫБОР
	|			КОГДА Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Сотрудники.ДатаУвольнения > &ТекущаяДата
	|		КОНЕЦ
	|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сотрудники.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.СтруктурнаяЕдиница.ЭтоГруппа = ЛОЖЬ";
	
	Если ЗначениеЗаполнено(МассивСотрудников) И ТипЗнч(МассивСотрудников) = Тип("Массив") Тогда 
		Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Сотрудник В(&МассивСотрудников)
	|	И ", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");	
	
КонецФункции

// Функция - Получить ассистента сотрудника.
//
Функция ПолучитьАссистентаСотрудника(Сотрудник, СтруктурнаяЕдиница) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.Ассистент КАК Ассистент
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник = &Сотрудник
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");   
	
	Запрос.УстановитьПараметр("Сотрудник"		  , ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, Неопределено));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, Неопределено));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ассистент, Неопределено);
	
КонецФункции

// Функция получает максимальную скидку сотрудника.
//
Функция ПолучитьМаксимальнуюСкидкуСотрудника(Сотрудник, СтруктурнаяЕдиница) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиСотрудников.МаксимальнаяРучнаяСкидка КАК МаксимальнаяРучнаяСкидка
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник = &Сотрудник
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";          
	
	Запрос.УстановитьПараметр("Сотрудник"		  , ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, Неопределено));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, Неопределено));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.МаксимальнаяРучнаяСкидка, 0);
КонецФункции

// Функция Получить врачей по структурной единице.
//
Функция ПолучитьВрачаПоСтруктурнойЕдинице(ТекстСтроки, СтруктурнаяЕдиница) Экспорт
	
	Если ПустаяСтрока(ТекстСтроки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =    
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.Сотрудник.Представление КАК Представление,
	|	НастройкиСотрудников.Сотрудник.Код КАК Код
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И (НастройкиСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НастройкиСотрудников.ДатаУвольнения > &ТекДата)
	|	И НастройкиСотрудников.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РОльПользователя.Врач)
	|	И НЕ НастройкиСотрудников.Сотрудник.ПометкаУдаления
	|	И (НастройкиСотрудников.Сотрудник.Фамилия ПОДОБНО &СтрокаПоиска
	|			ИЛИ НастройкиСотрудников.Сотрудник.Имя ПОДОБНО &СтрокаПоиска
	|			ИЛИ НастройкиСотрудников.Сотрудник.Отчество ПОДОБНО &СтрокаПоиска
	|			ИЛИ НастройкиСотрудников.Сотрудник.Наименование ПОДОБНО &СтрокаПоиска
	|			ИЛИ НастройкиСотрудников.Сотрудник.Код ПОДОБНО &СтрокаПоиска)";
		
	СтрокаПоиска = "%" + ТекстСтроки + "%"; 
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокСотрудников = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		Представление = Выборка.Представление + " (" + Выборка.Код + ")";
		СписокСотрудников.Добавить(Выборка.Сотрудник, Представление);		
	КонецЦикла;
	
	Если СписокСотрудников.Количество() = 0 Тогда	        		
		ТекстСтроки = Символ(34) + ТекстСтроки + Символ(34);
        СписокСотрудников.Добавить(Неопределено, ТекстСтроки + " нет в списке");
	КонецЕсли;
	
	Возврат СписокСотрудников;
	
КонецФункции 

#КонецОбласти
